IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/I2C1_I2C1.xml
	<register id="I2C1_ICIVR" acronym="I2C1_ICIVR" offset="0x28" width="32" description="">
		<bitfield id="NU2" width="20" begin="31" end="12" resetval="0x0" description="Reserved." range="31 - 12" rwaccess="RW"/> 
		<bitfield id="TESTMD" width="4" begin="11" end="8" resetval="0x0" description="Reserved for internal testing." range="11 - 8" rwaccess="RW"/> 
		<bitfield id="NU1" width="5" begin="7" end="3" resetval="0x0" description="Reserved." range="7 - 3" rwaccess="RW"/> 
		<bitfield id="INTCODE" width="3" begin="2" end="0" resetval="0x0" description="Interrupt code.  The binary-coded-interrupt vector indicates which interrupt  has  occurred. Reading the ICIVR clears the interrupt code except  ARDY(011) RRDY(100) and XRDY(101). Interrupt code for ARDY  RRDY and XRDY is cleared when ARDY ICRRDY and ICXRDY  bits in the ICSTR is cleared to default value respectively.  If other  interrupts are pending a new interrupt is generated. If  there are  more than one interrupt flag reading the ICIVR clears the  highest  priority interrupt code.  Reading the ICIVR also clears corresponding status bit in the  ICSTR except ARDY ICRRDY ICXRDY and AAS.  Note that users must read (clear) the ICIVR before doing  another  start otherwise the ICIVR could contain incorrect (old  interrupt flags)  value.  ________________________________________________Interrupt Code____________Interrupt Occurred___________000_(default)_________________None  _001_(highest priority)____Arbitration Lost interrupt  _010__________________No Acknowledgement interrupt  _011__________________Register Access Ready interrupt  _100__________________Receive Data Ready interrupt  _101__________________Transmit Data Ready interrupt  _110__________________Stop Condition Detection  _111_(lowest priority)_____Address As Slave - (RW)  ________________________________________________" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICEMDR" acronym="I2C1_ICEMDR" offset="0x2C" width="32" description="">
		<bitfield id="NU" width="30" begin="31" end="2" resetval="0x0" description="Reserved. - (RW  )" range="31 - 2" rwaccess="RW"/> 
		<bitfield id="IGNACK" width="1" begin="1" end="1" resetval="0x0" description="Ignore NACK mode  IGNACK=0 The master transmitter will operate normally  discontinue the data transfer and set the ARDY and NACK  status bits when a NACK signal is received from the slave.  IGNACK=1 The master transmitter will ignore a NACK  received from the slave." range="1" rwaccess="RW"/> 
		<bitfield id="BCM" width="1" begin="0" end="0" resetval="0x0" description="Backward Compatibility Mode.  This bit affects the I2C interrupt behavior. Refer to  appendix A  for details." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPSC" acronym="I2C1_ICPSC" offset="0x30" width="32" description="">
		<bitfield id="NU" width="24" begin="31" end="8" resetval="0x0" description="Reserved." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="IPSC7_IPSC0" width="8" begin="7" end="0" resetval="0x0" description="8-bit prescaler to divide the system clock down to 4/8/12Mhz  clock and used by the I2C module. This register must be  initialized while the I2C is still in reset (IRS_=0). The  value takes  effect on the rising edge of IRS_." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPID1" acronym="I2C1_ICPID1" offset="0x34" width="32" description="">
		<bitfield id="NU" width="16" begin="31" end="16" resetval="0x0" description="Reserved." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLASS" width="8" begin="15" end="8" resetval="0x0" description="Identifies the class of peripheral. This value should be  0x01 - (RW  )" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="REVISION" width="8" begin="7" end="0" resetval="0x0" description="Identifies the revision level of the I2C. This value should  be  incremented each time the design is revised. - (RW  )" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPID2" acronym="I2C1_ICPID2" offset="0x38" width="32" description="">
		<bitfield id="NU" width="24" begin="31" end="8" resetval="0x0" description="Reserved." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TYPE" width="8" begin="7" end="0" resetval="0x0" description="Identifies the type of peripheral. This value should be 0x05  - (RW  )" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICDMAC" acronym="I2C1_ICDMAC" offset="0x3C" width="32" description="">
		<bitfield id="NU" width="30" begin="31" end="2" resetval="0x0" description="Reserved. - (RW  )" range="31 - 2" rwaccess="RW"/> 
		<bitfield id="TXDMAEN" width="1" begin="1" end="1" resetval="0x0" description="Transmit DMA enable. This bit controls the receive DMA  event pin to the system. When this bit is 1 the DMA event is  enabled and ICTEVT_POR pin is asserted when the DMA  transfer is required. When this bit is 0 the ICTEVT_POR pin  is never asserted.  RXDMAEN=0: DMA transmit event is disabled.  RXDMAEN=1: DMA transmit event is enabled. (Default)" range="1" rwaccess="RW"/> 
		<bitfield id="RXDMAEN" width="1" begin="0" end="0" resetval="0x0" description="Receive DMA enable. This bit controls the receive DMA  event pin to the system. When this bit is 1 the DMA event is  enabled and ICREVT_POR pin is asserted when the DMA  transfer is required. When this bit is 0 the ICREVT_POR  pin is never asserted.  RXDMAEN=0: DMA receive event is disabled.  RXDMAEN=1: DMA receive event is enabled. (Default)" range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_I2C_RESERVED1" acronym="I2C1_I2C_RESERVED1" offset="0x40" width="32" description="">
		<bitfield id="NU" width="32" begin="31" end="0" resetval="0x0" description="Reserved." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C1_I2C_RESERVED2" acronym="I2C1_I2C_RESERVED2" offset="0x44" width="32" description="">
		<bitfield id="NU" width="32" begin="31" end="0" resetval="0x0" description="Reserved." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPFUNC" acronym="I2C1_ICPFUNC" offset="0x48" width="32" description="">
		<bitfield id="NU" width="31" begin="31" end="1" resetval="0x0" description="Reserved." range="31 - 1" rwaccess="RW"/> 
		<bitfield id="PFUNC0" width="1" begin="0" end="0" resetval="0x0" description="Controls the function of the I2C SCL and SDA pins.  0 = Pins function as SCL and SDA  1 = Pins functions as GPIO  Note: No hardware protection is required to disable I2C  function when the PFUNC[0] and IRS_ bits are both set to  one. When PFUNC[0] is'1' (GPIO mode) the sub-module  which controls the I2C function receives the value'1' for  SCL  and SDA. IRS_ can be set to'1' regardless of PFUNC[0]  and the I2C function works whenever the IRS_ bit is'1'. The  user is expected to hold I2C in reset via IRS_ bit when  changing to/from GPIO mode via the PFUNC[0] bit." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPDIR" acronym="I2C1_ICPDIR" offset="0x4C" width="32" description="">
		<bitfield id="PDIR1" width="1" begin="1" end="1" resetval="0x0" description="Controls the direction of the I2C SDA pin when configured as  GPIO.  0 = SDA pin functions as input  1 = SDA pin functions as output" range="1" rwaccess="RW"/> 
		<bitfield id="PDIR0" width="1" begin="0" end="0" resetval="0x0" description="Controls the direction of the I2C SCL pin when configured as  GPIO.  0 = SCL pin functions as input  1 = SCL pin functions as output" range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPDIN" acronym="I2C1_ICPDIN" offset="0x50" width="32" description="">
		<bitfield id="PDIN1" width="1" begin="1" end="1" resetval="0x0" description="Indicates the logic level present on the SDA pin.  Reads:  0 = Logic low present at SDA pin regardless of PFUNC  setting.  1 = Logic high present at SDA pin regardless of PFUNC  setting.  Writes:  Writes have no effect. - (RW  )" range="1" rwaccess="RW"/> 
		<bitfield id="PDIN0" width="1" begin="0" end="0" resetval="0x0" description="Indicates the logic level present on the SCL pin.  Reads:  0 = Logic low present at SCL pin regardless of PFUNC  setting.  1 = Logic high present at SCL pin regardless of PFUNC  setting.  Writes:  Writes have no effect - (RW  )" range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPDOUT" acronym="I2C1_ICPDOUT" offset="0x54" width="32" description="">
		<bitfield id="PDOUT1" width="1" begin="1" end="1" resetval="0x0" description="Controls the level driven on the SDA pin when configured as  GPIO output.  Reads:  Reads return register values not GPIO pin levels.  Writes:  0 = SDA pin driven low  1 = SDA pin driven high.  Note: If SDA is connected to an open-drain buffer at the  chiplevel  the I2C cannot drive SDA to high." range="1" rwaccess="RW"/> 
		<bitfield id="PDOUT0" width="1" begin="0" end="0" resetval="0x0" description="Controls the level driven on the SCL pin when configured as  GPIO output.  Reads:  Reads return register values not GPIO pin levels.  Writes:  0 = SCL pin driven low  1 = SCL pin driven high  Note: If SCL is connected to an open-drain buffer at the  chiplevel  the I2C cannot drive SCL to high." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPDSET" acronym="I2C1_ICPDSET" offset="0x58" width="32" description="">
		<bitfield id="PDSET1" width="1" begin="1" end="1" resetval="0x0" description="Used to set PDOUT[1] bit which corresponds to the SDA GPIO  pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[1] bit is set to logic high." range="1" rwaccess="RW"/> 
		<bitfield id="PDSET0" width="1" begin="0" end="0" resetval="0x0" description="Used to set PDOUT[0] bit which corresponds to the SCL GPIO  pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[0] bit is set to logic high." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPDCLR" acronym="I2C1_ICPDCLR" offset="0x5C" width="32" description="">
		<bitfield id="PDCLR1" width="1" begin="1" end="1" resetval="0x0" description="Used to clear PDOUT[1] bit which corresponds to the SDA pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[1] bit is cleared to logic low." range="1" rwaccess="RW"/> 
		<bitfield id="PDCLR0" width="1" begin="0" end="0" resetval="0x0" description="Used to clear PDOUT[0] bit which corresponds to the SCL pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[0] bit is cleared to logic low." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C1_ICPDRV" acronym="I2C1_ICPDRV" offset="0x60" width="32" description="">
		<bitfield id="PDRV1" width="1" begin="1" end="1" resetval="0x0" description="Used to select driver mode of output buffer for SDA pin.  0 = I2C mode.   1 = GPIO mode. Note: Value of this register is reflected on the  PDRV_SDA_POR port. Actual function depends on I/O buffer and  chip implementation." range="1" rwaccess="RW"/> 
		<bitfield id="PDRV0" width="1" begin="0" end="0" resetval="0x0" description="Used to select driver mode of output buffer for SCL pin.  0 = I2C mode. 1 = GPIO mode. Note: Value of this register is reflected on the  PDRV_SCL_POR port. Actual function depends on I/O buffer  and chip implementation." range="0" rwaccess="RW"/>
	</register>
</module>